{
  "Customer Focus": [
    {
      "id": 0,
      "question": "Tell me about a situation with a very demanding customer that you handled well. "
    },
    {
      "id": 1,
      "question": "Tell me about a situation with a very demanding customer that you handled poorly. WHat went wrong? What would you do differently?"
    },
    {
      "id": 2,
      "question": "Describe the steps you would take if a customer came to you with a problem you could solve at your job level."
    },
    {
      "id": 3,
      "question": "Tell me about a time when you did your best to resolve a customer or client concern and the individual still was not satisfied. What did you do next?"
    },
    {
      "id": 4,
      "question": "Tell me about a time you exceeded a customer’s expectations. How did it make the customer feel? How did it make you feel?"
    },
    {
      "id": 5,
      "question": "Describe a situation where you were given exceptional customer service. What made it stand out?"
    },
    {
      "id": 6,
      "question": "GIve me an example of when you were given special recognition or acknowledgment for going the extra mile to satisfy a customer."
    },
    {
      "id": 7,
      "question": "Describe the steps you would take if a customer came to you with a problem that was beyond your knowledge and/or responsibilities."
    },
    {
      "id": 8,
      "question": "Describe a recent situation when you didn’t know with whom you needed to speak in organization to get something done. What did you do?"
    },
    {
      "id": 9,
      "question": "Tell me about a time that you had to go out of your immediate network/job duties to help a customer."
    },
    {
      "id": 10,
      "question": "Tell me about a time when you didn’t have the answer to a question that a customer wanted right away. What did you do? What was the final outcome?"
    },
    {
      "id": 11,
      "question": "Tell me about the worst customer you’ve ever had and how you dealt with him or her."
    },
    {
      "id": 12,
      "question": "Describe the steps you would use to calm an angry customer."
    },
    {
      "id": 13,
      "question": "Tell me about a time that a customer came to you angry (not necessarily at you) and how you worked with that customer to solve the issue."
    },
    {
      "id": 14,
      "question": "Have you ever had a customer get angry at something that wasn’t your fault? If so, please explain. "
    },
    {
      "id": 15,
      "question": "Describe a situation when you took a stand for a customer."
    },
    {
      "id": 16,
      "question": "Give us an example of a time when you used your customer service philosophy to deal with a perplexing problem. "
    }
  ],
  "Diversity": [
    {
      "id": 17,
      "question": "Tell me about a time when you needed to understand another person’s cultural background in order to work effectively with him or her?"
    },
    {
      "id": 18,
      "question": "Tell us about a time when you have taken steps to ensure that everyone (in your class, on your team, in your organization) felt included. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 19,
      "question": "What diversity, inclusion and or cultural competence training have you received and how have you applied what you learned on the job? "
    },
    {
      "id": 20,
      "question": "Describe a time when you had to help resolve a conflict between two colleagues or students. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 21,
      "question": "Describe how your career has been enhanced by exposure to diverse people, places, or experiences. Please provide a specific example. "
    },
    {
      "id": 22,
      "question": "What is your approach to dealing with discussions about potentially difficult topics, such as race, religion, politics, or sexual orientation? Please provide a specific example. "
    },
    {
      "id": 23,
      "question": "How have you incorporated the viewpoints and perspectives of underrepresented groups into your curriculum? Please provide a specific example. "
    },
    {
      "id": 24,
      "question": "What do you see as the most challenging aspect of working with a diverse student body? What steps have you taken to meet this challenge? "
    },
    {
      "id": 25,
      "question": "Tell us about a time when a colleague or student was not accepting of another’s diversity? Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 26,
      "question": "Tell us about one or two specific things that you have done to promote diversity, equity and/or inclusion in your current (or last) job? "
    },
    {
      "id": 27,
      "question": "What steps have you taken to reduce bias and champion diversity understanding in your classes (or in your current job)? Please provide a specific example. "
    },
    {
      "id": 28,
      "question": "What steps have you taken at your current (or last) employer to create an inclusive work or learning environment? "
    },
    {
      "id": 29,
      "question": "What diversity challenges do you face in your current (or last) job? How did you address those challenges? Please provide a specific example. "
    },
    {
      "id": 30,
      "question": "Please describe how you work to create a campus environment that is welcoming and inclusive? Please provide a specific example. "
    },
    {
      "id": 31,
      "question": "What is your definition of diversity? "
    },
    {
      "id": 32,
      "question": "How do you encourage people to honor the uniqueness of each individual? Please provide a specific example. "
    },
    {
      "id": 33,
      "question": "How do you challenge stereotypes and promote sensitivity and inclusion? Please provide a specific example. "
    },
    {
      "id": 34,
      "question": "Describe your experience in serving or teaching underrepresented communities. What did you learn from this experience? "
    },
    {
      "id": 35,
      "question": "Describe a situation in which you utilized your multicultural skills to solve a problem. "
    },
    {
      "id": 36,
      "question": "Please provide an example of how you approached educating students about diversity, equity, or inclusion."
    },
    {
      "id": 37,
      "question": "Tell us about a time when you changed your style to work more effectively with a person from a different background. "
    },
    {
      "id": 38,
      "question": "Tell us about a time when you had to deal with conflict at work. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 39,
      "question": "Describe the most difficult colleague or student you've ever had to deal with at work. Why was he/she challenging? What did you do? "
    },
    {
      "id": 40,
      "question": "Describe a time when you needed to work cooperatively with someone that did not share the same ideas as you. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 41,
      "question": "Tell us about a time when you were unable to be tolerant of another person’s point of view. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 42,
      "question": "Tell us about a time when you created an environment of honesty, inclusion and respect for others. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 43,
      "question": "How will you contribute to the College’s efforts to enhance diversity, equity and inclusion in a meaningful way? How have you approached this on your current (or last) job? "
    },
    {
      "id": 44,
      "question": "Provide us with an example of how you work with people to create or foster civility in the workplace. "
    },
    {
      "id": 45,
      "question": "How do you adapt your teaching to meet the different culture and learning styles of your students? "
    },
    {
      "id": 46,
      "question": "Tell us about a time when you responded to a co-worker or student who made an insensitive remark. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 47,
      "question": "Tell us about a time when you were challenged by a situation where others were behaving in an inappropriate or uncivil way. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 48,
      "question": "Tell us about a time when effective listening skills helped you in a problematic situation. Describe the situation, the actions you took, and the outcome. "
    },
    {
      "id": 49,
      "question": "Describe a time when you were able to overcome a communication barrier. What steps did you take and why? What was the outcome? "
    },
    {
      "id": 50,
      "question": "Tell us about a time when you showed empathy toward another individual or group. Describe the situation, the actions you took, and the outcome."
    }
  ],
  "Values": [
    { "id": 51, "question": "Tell me about your level of integrity" },
    {
      "id": 52,
      "question": "What will your references tell me about your integrity?"
    },
    {
      "id": 53,
      "question": "Describe a politically sensitive situation that you were in and how you handled the situation."
    },
    {
      "id": 54,
      "question": "Tell me about a time when you made a mistake but there was little chance of anyone else finding out. How did you handle the mistake and what was the resolution?"
    },
    {
      "id": 55,
      "question": "Tell me about a time when you bypassed your supervisor and went to your supervisor’s supervisor to handle a situation."
    },
    {
      "id": 56,
      "question": "Tell me about a situation that illustrates your ability to exercise good judgment."
    },
    {
      "id": 57,
      "question": "Describe a situation where you had to keep information confidential."
    },
    {
      "id": 58,
      "question": "Describe a situation in which you promised more than you could deliver. How did you handle it?"
    },
    {
      "id": 59,
      "question": "GIve me an example of time when you chose to be completely honest, even when doing so was risky and potentially damaging for you."
    },
    {
      "id": 60,
      "question": "Tell me about a time when you believe someone broke unwritten rules or violated acceptable business behavior. What was your role and what happened?"
    },
    {
      "id": 61,
      "question": "Can you tell me about a situation when you had to bend the rules to get the job done?"
    },
    {
      "id": 62,
      "question": "Tell me about a time when someone challenged our integrity. How did you handle it?"
    },
    {
      "id": 63,
      "question": "Describe a recent moral or ethical dilemma you have encountered."
    },
    {
      "id": 97,
      "question": "Give me an example of a time you did something wrong"
    }
  ],
  "Communication": [
    {
      "id": 64,
      "question": "Tell me about a time you had to use written communication to get a point across?"
    },
    {
      "id": 65,
      "question": "Tell me about the best written proposal you have created? Why was it best? How did you know it was good?"
    },
    {
      "id": 66,
      "question": "Discuss a time when you had to assert yourself (speak up) in order to get a point across that was important to you."
    },
    {
      "id": 67,
      "question": "Have you ever had to “sell” an idea to your co-workers? How did you do it?"
    },
    {
      "id": 68,
      "question": "Give an example of time you were able to successfully communicate with an individual when that person may not have liked you."
    },
    {
      "id": 69,
      "question": "Give an example of a difficult or sensitive situation that required extensive communication."
    },
    {
      "id": 70,
      "question": "Tell me about a time when the ability to communicate effectively was critical to the success of a task or project."
    },
    {
      "id": 71,
      "question": "Describe for me a situation where you missed some important details that were communicated to you."
    },
    {
      "id": 72,
      "question": "Discuss a situation where your failure to listen attentively to a co-worker caused ill feelings because of their hastiness to get going before you fully understood what they were trying to communicate."
    },
    {
      "id": 73,
      "question": "Tell me about a time when you had difficulty understanding a conversation the person was trying to make. "
    },
    {
      "id": 74,
      "question": "Tell me about a time you worked with someone who as very difficult to understand. Explain how you overcame the situation."
    },
    {
      "id": 75,
      "question": "Tell me about how you communicate with your current supervisor concerning project process, concerns, and suggestions. "
    },
    {
      "id": 76,
      "question": "Describe how your ability to communicate effectively and build relationships with many different types of people has contributed to one of your greatest accomplishments."
    },
    {
      "id": 77,
      "question": "Describe some tricky situations in which you had to talk to people to obtain information you needed to make an important decision or recommendation."
    },
    {
      "id": 78,
      "question": "Have you prepared and communicated ideas and information in a formal setting? "
    },
    {
      "id": 94,
      "question": "Have you had to convince a team to work on a project they weren't thrilled about? How did you do it?"
    },
    {
      "id": 95,
      "question": "Have you handled a difficult situation with a co-worker? How?"
    }
  ],
  "Individual Responsibility": [
    {
      "id": 79,
      "question": "There are times when a firm decision must be made quickly, and there are other times when it is prudent to consider all angles before reaching a conclusion. Give an example of a situation when you took time in making a final decision."
    },
    {
      "id": 80,
      "question": "Rarely do issues arise that are one-dimensional. With that fact in mind, describe a time you handled a situation that had different layers."
    },
    {
      "id": 81,
      "question": "Tell me about a time when you encountered competing deadlines and you had to choose one deadline to fall by the wayside in order to meet the others."
    },
    {
      "id": 82,
      "question": "It is impossible to please every staff member or client. Describe a time when you made an unpopular decision."
    },
    {
      "id": 83,
      "question": "Recall a time when you were approached to take sides on an issue, but decided to stay neutral."
    },
    {
      "id": 84,
      "question": "Tell me about a time when you came up with a way to increase output."
    },
    {
      "id": 85,
      "question": ". Describe an occasion when you made a decision that could have had a negative impact on the company if not managed correctly"
    },
    {
      "id": 86,
      "question": "Give an example of a time when you were surprised by an unexpected situation and had to change course quickly."
    },
    {
      "id": 87,
      "question": "Recall a time when you used good judgment and logic in solving a problem."
    },
    {
      "id": 88,
      "question": "Tell me about a time when you thought a problem was resolved, only to find out that you were mistaken."
    },
    {
      "id": 89,
      "question": "Not all problems have clear-cut solutions. Give an example of a difficult decision you made and your thought process for making it."
    },
    {
      "id": 90,
      "question": "Summarize a time when you managed a situation characterized by high pressure."
    },
    {
      "id": 91,
      "question": "Give an example of a goal you reached and tell me how you achieved it."
    },
    {
      "id": 92,
      "question": "Describe a decision you made that was unpopular and how you handled implementing it."
    },
    {
      "id": 93,
      "question": "What do you do when your schedule is interrupted? Give me an example of how you handle it."
    },
    {
      "id": 96,
      "question": "Tell me about how you worked effectively under pressure."
    }
  ]
}
